[
    {
        "name": "Grilled Mac and Cheese Sandwich",
        "description": "Grilled Mac and Cheese Sandwich",
        "image": "https://www.themealdb.com/images/media/meals/xutquv1505330523.jpg",
        "ingredients": "Macaroni, Plain Flour, Mustard Powder, Garlic powder, Kosher salt, Black pepper, Cayenne pepper, Butter, Whole Milk, Heavy Cream, Monterey Jack Cheese, Bread, Cheddar Cheese, Colby Jack Cheese",
        "instructions": "Make the mac and cheese\r\n\r\n1. Bring a medium saucepan of generously salted water (you want it to taste like seawater) to a boil. Add the pasta and cook, stirring occasionally, until al dente, 8 to 10 minutes, or according to the package directions. The pasta should be tender but still chewy.\r\n2. While the pasta is cooking, in a small bowl, whisk together the flour, mustard powder, garlic powder, salt, black pepper, and cayenne pepper.\r\n3. Drain the pasta in a colander. Place the empty pasta pan (no need to wash it) over low heat and add the butter. When the butter has melted, whisk in the flour mixture and continue to cook, whisking frequently, until the mixture is beginning to brown and has a pleasant, nutty aroma, about 1 minute. Watch carefully so it does not scorch on the bottom of the pan.\r\n4. Slowly whisk the milk and cream into the flour mixture until everything is really well combined. Cook, whisking constantly, until the sauce is heated through and just begins to thicken, about 2 minutes. Remove from the heat. Gradually add the cheese while stirring constantly with a wooden spoon or silicone spatula and keep stirring until the cheese has melted into the sauce. Then stir in the drained cooked pasta.\r\n5. Line a 9-by-13-inch (23-by-33-centimeter) rimmed baking sheet with parchment paper or aluminum foil. Coat the paper or foil with nonstick cooking spray or slick it with butter. Pour the warm mac and cheese onto the prepared baking sheet and spread it evenly with a spatula. Coat another piece of parchment paper with cooking spray or butter and place it, oiled or buttered side down, directly on the surface of the mac and cheese. Refrigerate until cool and firm, about 1 hour.\r\n\r\nMake the grilled cheese\r\n6. Heat a large cast-iron or nonstick skillet over medium-low heat.\r\n7. In a small bowl, stir together the 4 tablespoons (55 grams) butter and garlic powder until well blended.\r\n8. Remove the mac and cheese from the refrigerator and peel off the top layer of parchment paper. Carefully cut into 8 equal pieces. Each piece will make 1 grilled mac and cheese sandwich. (You can stash each individual portion in a double layer of resealable plastic bags and refrigerate for up to 3 days or freeze it for up to 1 month.)\r\n9. Spread 3\/4 teaspoon garlic butter on one side of each bread slice. Place half of the slices, buttered-side down, on a clean cutting board. Top each with one slice of Cheddar, then 1 piece of the mac and cheese. (Transfer from the baking sheet by scooting your hand or a spatula under each piece of mac and cheese and then flipping it over onto a sandwich.) Place 1 slice of Jack on top of each. Finish with the remaining bread slices, buttered-side up.\r\n10. Using a wide spatula, place as many sandwiches in the pan as will fit without crowding it. Cover and cook until the bottoms are nicely browned, about 4 minutes. Turn and cook until the second sides are browned, the cheese is melted, and the mac and cheese is heated through, about 4 minutes more.\r\n11. Repeat with the remaining ingredients. Cut the sandwiches in half, if desired, and serve.",
        "servings": 999,
        "prepTime": "999 Minutes",
        "cookTime": "999 Minutes"
    },
    {
        "name": "Christmas Pudding Flapjack",
        "description": "Christmas Pudding Flapjack",
        "image": "https://www.themealdb.com/images/media/meals/vvusxs1483907034.jpg",
        "ingredients": "Salted Butter, Dark Soft Brown Sugar, Golden Syrup, Orange, Rolled Oats, Christmas Pudding",
        "instructions": "Preheat the oven to 180°C\/fan 160°C\/gas mark 4 and grease and line a 25cm x 20cm tin. Melt the butter, sugar, syrup and orange zest in a large saucepan over a medium heat. The aim is to dissolve all the ingredients so that they are smooth, but to not lose any volume through boiling so be careful not to overheat.\r\n\r\nAdd the oats and stir well until evenly coated. Stir through the leftover Christmas pudding and tip into the prepared tin. Use a spoon to flatten the top and bake for 40 minutes until the edges start to brown. Whilst still warm in the tin, score into 12 squares. Allow to cool completely before cutting along the scores.\r\n\r\nKeeps for 5 days in an air tight tin or freeze for up to 1 month.",
        "servings": 999,
        "prepTime": "999 Minutes",
        "cookTime": "999 Minutes"
    },
    {
        "name": "Tourtiere",
        "description": "Tourtiere",
        "image": "https://www.themealdb.com/images/media/meals/ytpstt1511814614.jpg",
        "ingredients": "Potatoes, Sunflower Oil, Minced Pork, Onion, Garlic Clove, Cinnamon, Allspice, Nutmeg, Vegetable Stock, Shortcrust Pastry, Egg",
        "instructions": "Heat oven to 200C\/180C fan\/gas 6. Boil the potato until tender, drain and mash, then leave to cool. Heat the oil in a non-stick pan, add the mince and onion and quickly fry until browned. Add the garlic, spices, stock, plenty of pepper and a little salt and mix well. Remove from the heat, stir into the potato and leave to cool.\r\nRoll out half the pastry and line the base of a 20-23cm pie plate or flan tin. Fill with the pork mixture and brush the edges of the pastry with water. Roll out the remaining dough and cover the pie. Press the edges of the pastry to seal, trimming off the excess. Prick the top of the pastry case to allow steam to escape and glaze the top with the beaten egg.\r\nBake for 30 mins until the pastry is crisp and golden. Serve cut into wedges with a crisp green salad. Leftovers are good cold for lunch the next day, served with a selection of pickles.",
        "servings": 999,
        "prepTime": "999 Minutes",
        "cookTime": "999 Minutes"
    },
    {
        "name": "Cheeseburger Piza",
        "description": "A pizza that tastes just like a burger! Make this cheeseburger pizza recipe―topped with ground beef, cheese, pickles, lettuce, tomatoes, and special sauce―and turn a regular weeknight into a party.",
        "image": "https://www.simplyrecipes.com/thmb/8oa6uULpczh0CRMywXAbh2jtnMo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Cheeseburger-Pizza-LEAD-3-4461a7801e2840149aee537c5069cd2d.jpg",
        "protein": "Ground Chuck",
        "ingredients": "Secret Sauce, 1 cup mayonnaise, 1/4 cup yellow onion, minced, 2 tablespoons ketchup, 1 tablespoon yellow mustard, 1 teaspoon lemon juice, 1/2 teaspoon sweet paprika, 1/4 teaspoon salt, Pizza, 1 pound ground chuck, 1/2 yellow onion about 1 cup, minced, 2 teaspoons burger or steak seasoning, 1-pound ball pizza dough , fully risen,Flour, as needed for shaping the dough, 1 egg yolk, 1 tablespoon cold water, 2 tablespoons sesame seeds, 1 1/4 to 1 1/2 cups Secret Sauce or Thousand Island dressing, divided, 2 1/2 to 3 cups (12 ounces) shredded sharp cheddar cheese, 3/4 cup dill pickle slices, 10 cherry tomatoes, halved, 1 cup shredded romaine lettuce.",
        "instructions": "Preheat the oven to 400°F (204°C). Sprinkle a 12-14-inch pizza pan with the cornmeal. This will keep your pizza crust from sticking to the pan later. Set the pan aside. Prepare the secret sauce: In a medium bowl, whisk together the mayonnaise, yellow onion, ketchup, yellow mustard, lemon juice, sweet paprika, and salt until smooth. Once the mixture is smooth, allow it to sit at room temperature or in the fridge to allow the flavors to combine while you start cooking the ground meat. You’ll have between 1 1/4 and 1 1/2 cups of sauce. Brown the ground beef and onions: Add the ground meat and onions to a large skillet. Turn the stove up to medium-high heat and sprinkle the burger seasoning over the beef and onions. Cooking the meat this way eliminates the need for additional oil in the pan, as the fat will render from the meat. Once the stove has been turned on, start breaking up the meat and mixing in the onions and spices with a spoon or spatula. Cook until the meat is fully cooked and no pink remains, about 10 minutes. Use a large spoon to drain off most of the fat; discard the fat. Set the skillet aside, off the heat. Lightly flour your hands and a rolling pin. Roll the pizza dough out into a circle that's 1-2 inches larger than your pizza pan. Prepare the egg wash in a small bowl by whisking together the egg yolk and cold water. Brush a 1 1/2-inch border around the outer rim of the pizza dough with the egg wash. Roll the edges of the pizza in 2 inches towards the center of the circle to create the pizza crust. Brush a light layer of the egg wash onto the crust you've just formed and sprinkle the sesame seeds onto the egg wash. Use the tines of a fork to prick holes in the dough in the center of the pan. Slide the pan into the preheated oven and bake for 10 minutes. Once the pizza dough is lightly browned and has blistered slightly, remove the pan from the oven. Use the back of a wide spoon to spread 1 1/4 cups of the secret sauce onto the pizza crust. Sprinkle half of the shredded cheddar cheese over the sauce, then top the cheese with the seasoned burger-onion mixture. Next, arrange the pickles and halved tomatoes on top of the beef and top with the remaining cheese. Bake the pizza until the cheese is fully melted and the pizza crust is golden brown in color, 10-12 minutes. Garnish and serve: Once the pizza is fully baked, remove it from the oven and allow it to cool for 1-2 minutes before sprinkling it with the shredded lettuce and drizzling the remaining 1/4 cup of secret sauce over it.",
        "servings": "6 to 8",
        "prepTime": "15 Minutes",
        "cookTime": "30 Minutes"
    },
    {
        "name": "Vegetarian Pad Thai",
        "description": "Salty, sweet, and tangy vegetarian pad thai is easy to cook at home. A delicious combination of chewy noodles, tofu, and veggies with lots of crunchy toppings makes a dinner everyone will love.",
        "image": "https://www.simplyrecipes.com/thmb/Fyt-fmc7ppeGwt2C1fRrHVHWfmM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Vegetarian-Pad-Thai-LEAD-3-f47ff2bc806b4de9821e332a6126bcc1.jpg",
        "protein": "Tofu",
        "ingredients": "1 14-ounce package rice noodles 1/4 to 1/2-inch wide, For the sauce, 1 cup water, 1/2 cup tamarind concentrate, 1/2 cup vegetarian fish sauce, 1/4 cup brown sugar, packed, 1 teaspoon kosher salt, plus more to taste, 1/4 teaspoon red chili flakes (optional), 1/4 teaspoon ground white pepper, For the stir-fry, 1 (16-ounce) pack firm or extra-firm tofu, cubed, 3 to 4 tablespoons vegetable or canola oil, 2 large eggs, 4 cloves garlic, minced, 1 large shallot, minced, 1 medium carrot, shredded (about 1 cup), 1/4 head cabbage, shredded, 1 cup mung bean sprouts, 3 green onions, trimmed and julienned into 2-inch long pieces, 1/4 cup peanuts, roughly chopped, Salt, if needed, to taste, For the toppings, 1 bunch fresh cilantro, leaves roughly chopped, 2 limes, quartered, 1/4 cup peanuts, roughly chopped, 1 green onion, sliced, Red chili flakes, to taste",
        "instructions": "Prepare the noodles: Fill a large bowl halfway with lukewarm water and slide in the rice noodles. If needed, add more water to the noodles or use a plate to weigh them down so they are submerged. Let the soak at least 10 minutes, or until ready to stir-fry. Make the sauce: Add all of the sauce ingredients to a medium bowl or large measuring pitcher and whisk to combine and dissolve the sugar. Taste, adding more sugar or salt if needed. It should be salty, tangy, and lightly sweet. Set aside until you are ready to stir-fry your noodles. Prepare the tofu and drain the noodles: Place a few layers of paper towels onto a sturdy plate and place the cubed tofu on top in a single layer. Add another few layers of paper towels on top, then place a sturdy plate on top. Give it a light press until some liquid is released from the tofu. Once the noodles have soaked for at least 10 minutes, drain them in a colander. You should be able to bend them without snapping. Fry the tofu: Heat up a large wok, a 14 to 16-inch, deep non-stick frying pan, or a large electric skillet to medium-high and add 2 tablespoons of oil. Once hot, add the prepared tofu. Let one side sear for about 1 minute or until it is golden. Use tongs or a spatula to flip your tofu pieces so 2 sides are golden. Stir-fry the vegetables and egg: Add another tablespoon of oil into the pan, then crack the eggs in with the tofu. Give the eggs a quick stir, turn the heat down to medium, and add the garlic and shallots. Sauté until the eggs are soft scrambled, 2 to 3 minutes. Push the eggs aside and add the carrot, cabbage, bean sprouts, and green onions. Turn the heat back up to medium-high and let the vegetables sear for 2 to 3 minutes, then stir until they are beginning to soften. Add the rice noodles: Add the drained rice noodles and toss with the vegetables. Give the sauce a stir and pour it into the frying pan. Add the peanuts and adjust the heat to bring it to a boil and then maintain a simmer. Let simmer until the noodles start to soften, tossing occasionally, about 5 minutes. Carefully stir fry the rice noodles until they are thoroughly coated in the sauce, the noodles are al dente, and the sauce has mostly soaked in to form a tacky coating, 5 to 10 minutes. Turn off the heat. Add the rice noodles: Add the drained rice noodles and toss with the vegetables. Give the sauce a stir and pour it into the frying pan. Add the peanuts and adjust the heat to bring it to a boil and then maintain a simmer. Let simmer until the noodles start to soften, tossing occasionally, about 5 minutes. Carefully stir fry the rice noodles until they are thoroughly coated in the sauce, the noodles are al dente, and the sauce has mostly soaked in to form a tacky coating, 5 to 10 minutes. Turn off the heat.",
        "servings": "6",
        "prepTime": "20 Minutes",
        "cookTime": "30 Minutes"
    },
    {
        "name": "Adobo Chicken Meatballs",
        "description": "Quick and easy chicken meatballs are cooked on the stove with a savory, sweet, and tangy adobo sauce made with coconut milk. Serve with rice for a flavorful, complete meal.",
        "image": "https://www.simplyrecipes.com/thmb/_MFKNTzx6aLkZCqpAuHNm_EsyeI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Chicken-Adobo-Meatballs-LEAD-03-1ae782ccd2d84a4bac2bbbbcf12410e4.jpg",
        "protein": "Chicken",
        "ingredients": "For the meatballs, 1 pound ground chicken 90% lean or leaner, 1 large egg, 1/2 cup panko breadcrumbs, 1 teaspoon onion powder, 1/2 teaspoon garlic powder, 1/4 teaspoon ground black pepper, 1/2 teaspoon kosher salt, For the adobo and vegetables, 1/2 cup chicken broth, 1/2 cup coconut milk, 1/4 cup soy sauce, 2 1/2 tablespoons distilled white vinegar, 2 teaspoons brown sugar, 1/4 teaspoon ground black pepper, 2 tablespoons vegetable oil, 4 garlic cloves, thinly sliced, 1 medium yellow onion, sliced, 4 large carrots, sliced into 1/4-inch thick rounds, 1 bay leaf, 1 green onion, sliced, for serving",
        "instructions": "Make the meatball mixture: In a medium bowl, stir together the ground chicken, egg, breadcrumbs, onion powder, garlic powder, salt, and pepper until evenly mixed. Make the adobo sauce mixture: In a 2-cup liquid measuring cup, mix together the broth, coconut milk, soy sauce, vinegar, sugar, and pepper. Cook the meatballs: Place a large braising pan or high-sided skillet with a lid over medium heat and add the oil. When the oil is shimmering, use a small (1 1/2 tablespoon) cookie scoop or a spoon and your hands, shape the mixture into meatballs and gently drop them into the skillet as you go. Brown the meatballs for about 2 minutes on their first side, until golden brown. Use a spatula to gently turn them and brown them on another side, for 2 minutes more. Sauté them for one more minute, so all the sides have a little color or are at least opaque. Add the remaining ingredients and simmer: Scoot the meatballs to one side of the pan, and add the garlic cloves to the other side of the pan. Sauté for 1 minute, making sure they all come into contact with the oil and get a bit browned. Spread out the meatballs and add the onion, carrots, and bay leaf, using a spatula to poke them down around the meatballs. Pour the adobo sauce mixture over the meatballs and vegetables. When the mixture comes up to a simmer, cover the pan and turn the heat to medium-low. Let simmer for 15 minutes. Reduce the sauce and serve: Remove the lid, turn the heat up to medium-high, stir, and let simmer for another 5 to 7 minutes, stirring occasionally, until the sauce is reduced, thickened, and glossy. Sprinkle green onions on top. Serve with rice or cauliflower rice. Store any leftovers in a tightly lidded container in the refrigerator. To reheat, microwave each serving until piping hot, about 1 1/2 minutes.",
        "servings": "4",
        "prepTime": "10",
        "cookTime": "30"
    }

]