[
    {
        "name": "Cheeseburger Pizza",
        "description": "A pizza that tastes just like a burger! Make this cheeseburger pizza recipe―topped with ground beef, cheese, pickles, lettuce, tomatoes, and special sauce―and turn a regular weeknight into a party.",
        "image": "https://www.simplyrecipes.com/thmb/8oa6uULpczh0CRMywXAbh2jtnMo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Cheeseburger-Pizza-LEAD-3-4461a7801e2840149aee537c5069cd2d.jpg",
        "main_protein": "Ground Chuck",
        "ingredients": "Secret Sauce, 1 cup mayonnaise, 1/4 cup yellow onion, minced, 2 tablespoons ketchup, 1 tablespoon yellow mustard, 1 teaspoon lemon juice, 1/2 teaspoon sweet paprika, 1/4 teaspoon salt, Pizza, 1 pound ground chuck, 1/2 yellow onion about 1 cup, minced, 2 teaspoons burger or steak seasoning, 1-pound ball pizza dough , fully risen,Flour, as needed for shaping the dough, 1 egg yolk, 1 tablespoon cold water, 2 tablespoons sesame seeds, 1 1/4 to 1 1/2 cups Secret Sauce or Thousand Island dressing, divided, 2 1/2 to 3 cups (12 ounces) shredded sharp cheddar cheese, 3/4 cup dill pickle slices, 10 cherry tomatoes, halved, 1 cup shredded romaine lettuce.",
        "instructions": "Preheat the oven to 400°F (204°C). Sprinkle a 12-14-inch pizza pan with the cornmeal. This will keep your pizza crust from sticking to the pan later. Set the pan aside. Prepare the secret sauce: In a medium bowl, whisk together the mayonnaise, yellow onion, ketchup, yellow mustard, lemon juice, sweet paprika, and salt until smooth. Once the mixture is smooth, allow it to sit at room temperature or in the fridge to allow the flavors to combine while you start cooking the ground meat. You’ll have between 1 1/4 and 1 1/2 cups of sauce. Brown the ground beef and onions: Add the ground meat and onions to a large skillet. Turn the stove up to medium-high heat and sprinkle the burger seasoning over the beef and onions. Cooking the meat this way eliminates the need for additional oil in the pan, as the fat will render from the meat. Once the stove has been turned on, start breaking up the meat and mixing in the onions and spices with a spoon or spatula. Cook until the meat is fully cooked and no pink remains, about 10 minutes. Use a large spoon to drain off most of the fat; discard the fat. Set the skillet aside, off the heat. Lightly flour your hands and a rolling pin. Roll the pizza dough out into a circle that's 1-2 inches larger than your pizza pan. Prepare the egg wash in a small bowl by whisking together the egg yolk and cold water. Brush a 1 1/2-inch border around the outer rim of the pizza dough with the egg wash. Roll the edges of the pizza in 2 inches towards the center of the circle to create the pizza crust. Brush a light layer of the egg wash onto the crust you've just formed and sprinkle the sesame seeds onto the egg wash. Use the tines of a fork to prick holes in the dough in the center of the pan. Slide the pan into the preheated oven and bake for 10 minutes. Once the pizza dough is lightly browned and has blistered slightly, remove the pan from the oven. Use the back of a wide spoon to spread 1 1/4 cups of the secret sauce onto the pizza crust. Sprinkle half of the shredded cheddar cheese over the sauce, then top the cheese with the seasoned burger-onion mixture. Next, arrange the pickles and halved tomatoes on top of the beef and top with the remaining cheese. Bake the pizza until the cheese is fully melted and the pizza crust is golden brown in color, 10-12 minutes. Garnish and serve: Once the pizza is fully baked, remove it from the oven and allow it to cool for 1-2 minutes before sprinkling it with the shredded lettuce and drizzling the remaining 1/4 cup of secret sauce over it.",
        "servings": 6,
        "prep_time": "15 Minutes",
        "cook_time": "30 Minutes",
        "total_time": 45
    },
    {
        "name": "Vegetarian Pad Thai",
        "description": "Salty, sweet, and tangy vegetarian pad thai is easy to cook at home. A delicious combination of chewy noodles, tofu, and veggies with lots of crunchy toppings makes a dinner everyone will love.",
        "image": "https://www.simplyrecipes.com/thmb/Fyt-fmc7ppeGwt2C1fRrHVHWfmM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Vegetarian-Pad-Thai-LEAD-3-f47ff2bc806b4de9821e332a6126bcc1.jpg",
        "main_protein": "Tofu",
        "ingredients": "1 14-ounce package rice noodles 1/4 to 1/2-inch wide, For the sauce, 1 cup water, 1/2 cup tamarind concentrate, 1/2 cup vegetarian fish sauce, 1/4 cup brown sugar, packed, 1 teaspoon kosher salt, plus more to taste, 1/4 teaspoon red chili flakes (optional), 1/4 teaspoon ground white pepper, For the stir-fry, 1 (16-ounce) pack firm or extra-firm tofu, cubed, 3 to 4 tablespoons vegetable or canola oil, 2 large eggs, 4 cloves garlic, minced, 1 large shallot, minced, 1 medium carrot, shredded (about 1 cup), 1/4 head cabbage, shredded, 1 cup mung bean sprouts, 3 green onions, trimmed and julienned into 2-inch long pieces, 1/4 cup peanuts, roughly chopped, Salt, if needed, to taste, For the toppings, 1 bunch fresh cilantro, leaves roughly chopped, 2 limes, quartered, 1/4 cup peanuts, roughly chopped, 1 green onion, sliced, Red chili flakes, to taste",
        "instructions": "Prepare the noodles: Fill a large bowl halfway with lukewarm water and slide in the rice noodles. If needed, add more water to the noodles or use a plate to weigh them down so they are submerged. Let the soak at least 10 minutes, or until ready to stir-fry. Make the sauce: Add all of the sauce ingredients to a medium bowl or large measuring pitcher and whisk to combine and dissolve the sugar. Taste, adding more sugar or salt if needed. It should be salty, tangy, and lightly sweet. Set aside until you are ready to stir-fry your noodles. Prepare the tofu and drain the noodles: Place a few layers of paper towels onto a sturdy plate and place the cubed tofu on top in a single layer. Add another few layers of paper towels on top, then place a sturdy plate on top. Give it a light press until some liquid is released from the tofu. Once the noodles have soaked for at least 10 minutes, drain them in a colander. You should be able to bend them without snapping. Fry the tofu: Heat up a large wok, a 14 to 16-inch, deep non-stick frying pan, or a large electric skillet to medium-high and add 2 tablespoons of oil. Once hot, add the prepared tofu. Let one side sear for about 1 minute or until it is golden. Use tongs or a spatula to flip your tofu pieces so 2 sides are golden. Stir-fry the vegetables and egg: Add another tablespoon of oil into the pan, then crack the eggs in with the tofu. Give the eggs a quick stir, turn the heat down to medium, and add the garlic and shallots. Sauté until the eggs are soft scrambled, 2 to 3 minutes. Push the eggs aside and add the carrot, cabbage, bean sprouts, and green onions. Turn the heat back up to medium-high and let the vegetables sear for 2 to 3 minutes, then stir until they are beginning to soften. Add the rice noodles: Add the drained rice noodles and toss with the vegetables. Give the sauce a stir and pour it into the frying pan. Add the peanuts and adjust the heat to bring it to a boil and then maintain a simmer. Let simmer until the noodles start to soften, tossing occasionally, about 5 minutes. Carefully stir fry the rice noodles until they are thoroughly coated in the sauce, the noodles are al dente, and the sauce has mostly soaked in to form a tacky coating, 5 to 10 minutes. Turn off the heat. Add the rice noodles: Add the drained rice noodles and toss with the vegetables. Give the sauce a stir and pour it into the frying pan. Add the peanuts and adjust the heat to bring it to a boil and then maintain a simmer. Let simmer until the noodles start to soften, tossing occasionally, about 5 minutes. Carefully stir fry the rice noodles until they are thoroughly coated in the sauce, the noodles are al dente, and the sauce has mostly soaked in to form a tacky coating, 5 to 10 minutes. Turn off the heat.",
        "servings": 6,
        "prep_time": "20 Minutes",
        "cook_time": "30 Minutes",
        "total_time": 50
    },
    {
        "name": "Adobo Chicken Meatballs",
        "description": "Quick and easy chicken meatballs are cooked on the stove with a savory, sweet, and tangy adobo sauce made with coconut milk. Serve with rice for a flavorful, complete meal.",
        "image": "https://www.simplyrecipes.com/thmb/_MFKNTzx6aLkZCqpAuHNm_EsyeI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Chicken-Adobo-Meatballs-LEAD-03-1ae782ccd2d84a4bac2bbbbcf12410e4.jpg",
        "main_protein": "Chicken",
        "ingredients": "For the meatballs, 1 pound ground chicken 90% lean or leaner, 1 large egg, 1/2 cup panko breadcrumbs, 1 teaspoon onion powder, 1/2 teaspoon garlic powder, 1/4 teaspoon ground black pepper, 1/2 teaspoon kosher salt, For the adobo and vegetables, 1/2 cup chicken broth, 1/2 cup coconut milk, 1/4 cup soy sauce, 2 1/2 tablespoons distilled white vinegar, 2 teaspoons brown sugar, 1/4 teaspoon ground black pepper, 2 tablespoons vegetable oil, 4 garlic cloves, thinly sliced, 1 medium yellow onion, sliced, 4 large carrots, sliced into 1/4-inch thick rounds, 1 bay leaf, 1 green onion, sliced, for serving",
        "instructions": "Make the meatball mixture: In a medium bowl, stir together the ground chicken, egg, breadcrumbs, onion powder, garlic powder, salt, and pepper until evenly mixed. Make the adobo sauce mixture: In a 2-cup liquid measuring cup, mix together the broth, coconut milk, soy sauce, vinegar, sugar, and pepper. Cook the meatballs: Place a large braising pan or high-sided skillet with a lid over medium heat and add the oil. When the oil is shimmering, use a small (1 1/2 tablespoon) cookie scoop or a spoon and your hands, shape the mixture into meatballs and gently drop them into the skillet as you go. Brown the meatballs for about 2 minutes on their first side, until golden brown. Use a spatula to gently turn them and brown them on another side, for 2 minutes more. Sauté them for one more minute, so all the sides have a little color or are at least opaque. Add the remaining ingredients and simmer: Scoot the meatballs to one side of the pan, and add the garlic cloves to the other side of the pan. Sauté for 1 minute, making sure they all come into contact with the oil and get a bit browned. Spread out the meatballs and add the onion, carrots, and bay leaf, using a spatula to poke them down around the meatballs. Pour the adobo sauce mixture over the meatballs and vegetables. When the mixture comes up to a simmer, cover the pan and turn the heat to medium-low. Let simmer for 15 minutes. Reduce the sauce and serve: Remove the lid, turn the heat up to medium-high, stir, and let simmer for another 5 to 7 minutes, stirring occasionally, until the sauce is reduced, thickened, and glossy. Sprinkle green onions on top. Serve with rice or cauliflower rice. Store any leftovers in a tightly lidded container in the refrigerator. To reheat, microwave each serving until piping hot, about 1 1/2 minutes.",
        "servings": 4,
        "prep_time": "10",
        "cook_time": "30",
        "total_time": 40
    
    },
    {
        "name": "Rasta Pasta with Jerk Chicken",
        "description": "Toss penne with a creamy jerk-infused sauce for this Jamaican pasta dish. Bell peppers lend color. We add chicken, but try shrimp, too!",
        "image": "https://www.simplyrecipes.com/thmb/Lh21998mDdLXCpUhuwDNOK6Zom4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Rasta-Pasta-Jerk-Chicken-LEAD-05-1137bfafa6f34303a7fd7e392fa93f07.jpg",
        "main_protein": "Chicken",
        "ingredients": "For the green seasoning 1 medium onion, roughly chopped 10 cloves garlic, peeled, 1 small Scotch bonnet or habanero pepper, 5 to 6 stems of thyme, leaves removed, 3 tablespoons water For the chicken, 1 lime, 1 pound boneless, skinless chicken tenderloins, sliced into 2-inch pieces, 1 tablespoon hot jerk seasoning, 1 heaping tablespoon green seasoning, 1/2 teaspoon browning sauce (optional), 2 teaspoons neutral oil, like avocado or canola For the pasta 8 ounces penne, 4 teaspoons neutral oil, to cook chicken and vegetables, 1/2 green pepper, thinly sliced, 1/2 red pepper, thinly sliced, 1/2 yellow pepper, thinly sliced, 1/2 yellow onion, thinly sliced, 3 cloves garlic, minced, 2 teaspoons fresh thyme, leaves removed, 2 cups heavy cream, 1/2 teaspoon salt, 1/2 teaspoon black pepper, 1/2 teaspoon paprika, 1 cup shredded Parmesan cheese",
        "instructions": "Boil the water to cook the pasta: Bring a large pot of water to boil. Add salt to the water to help flavor the pasta as it cooks. (1 tablespoon of salt for every 2 quarts of water.) Make the green seasoning: In a food processor add the onion, garlic, Scotch bonnet or habanero pepper, thyme, and water. Pulse until the texture is slightly smooth and thick. Prep the chicken: Put the chicken pieces into a large mixing bowl. Roll the lime on the countertop to soften. Slice in half and squeeze the juice over the chicken. You can mix the lime halves with the chicken and leave it until you’re ready to rinse. Fill the bowl with water just until it covers the chicken. Using a wooden spoon or tongs, stir the chicken. Cover with plastic wrap and let it sit in the acidic water for 15-20 minutes. Prep the chicken: Put the chicken pieces into a large mixing bowl. Roll the lime on the countertop to soften. Slice in half and squeeze the juice over the chicken. You can mix the lime halves with the chicken and leave it until you’re ready to rinse. Fill the bowl with water just until it covers the chicken. Using a wooden spoon or tongs, stir the chicken. Cover with plastic wrap and let it sit in the acidic water for 15-20 minutes Rinse the chicken and pat dry: Gently drain the water out of the bowl. Fill the bowl of chicken with fresh cold water and gently drain again. Repeat this process twice to remove the lime and any slime the chicken might have. Pat chicken dry with paper towels Season and marinate the chicken: Add the hot jerk seasoning, green seasoning, browning sauce, and oil to the bowl of chicken. Massage the seasoning into meat using your hands or tongs. Cover the bowl with plastic wrap and refrigerate. Let the chicken marinate for a minimum of 30 minutes or up to overnight. Cook the pasta: Once the water has come to a rolling boil, add the dry pasta and cook, uncovered for 7-8 minutes, stirring occasionally. Keep the heat at medium-high for a rolling boil. Drain pasta in a colander, add drained pasta back to the pot and drizzle in a little oil to keep from sticking while you make the sauce and cook the chicken. Cook pasta according to package directions. Drain and set aside. Cook the chicken: Take the chicken out of the fridge, remove plastic wrap. In a deep non-stick skillet over medium heat, add 2 teaspoons of the oil. Using a pair of tongs place chicken in the pan, leaving excess marinade behind. Sauté about 10 minutes until the chicken is browned and the seasoning has dried onto the meat, turning the chicken occasionally. Chicken should read 165 degrees F if using a thermometer or juices should run clear when done. Remove from the pan and. Set aside. Cook the vegetables: Add a little more oil to the skillet. Add 2 more teaspoons to the skillet. Add the peppers, onion, and garlic. Sauté until tender, but still crisp, about 5 minutes. The peppers should still retain their color and not look dull. If you pierce with a fork the pepper should still have some give to it. Add the chicken back into the pan with the vegetables and toss to combine. Make the sauce: Add the heavy cream, salt, black pepper, and paprika. Let the cream simmer for 5 minutes. You’ll know it’s simmering when small bubbles appear on the surface. Stir in the Parmesan cheese and cook for an additional 1 to 2 minutes until the cheese melts. Remove from the heat and rest a bit, then serve: Remove from the heat and let the pasta rest for 2 minutes so the pasta can absorb the flavors of the sauce. Serve hot! Store leftover pasta in an airtight container with a lid in the fridge for up to 3 days. When reheating, I recommend not overheating because the cheese can melt too much and become oily.",
        "servings": 4,
        "prep_time": "20 Minutes",
        "cook_time": "52 Minutes",
        "total_time": 72
},
{
        "name": "Mom's Perfect Pork Chops",
        "description": "Pan-fried pork chops on the stovetop are so quick and easy! Use a homemade dry rub to really bring out the flavor of the chops.",
        "image": "https://www.simplyrecipes.com/thmb/2_novxVoaObh6lghx41t05BENWU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2008__02__Moms-Pork-Chops-LEAD-1-157c0318091d495aaa2fb964e8176f03.jpg",
        "main_protein": "Pork",
        "ingredients": "For Dad's dry rub (makes 1/2 cup): 1/4 cup cumin seeds, 3 tablespoons whole black peppercorns, 1 tablespoon coriander seeds, 2 tablespoons sugar, 1 1/2 teaspoons sea salt, For the pork chops: 4 pork chops (bone-in or boneless), 1 teaspoon bacon fat or extra virgin olive oil, Kosher salt, 1 to 2 teaspoons dry rub",
        "instructions": "Make the dry rub: Combine cumin, peppercorns, and coriander in a heavy medium skillet. Stir over medium heat until fragrant and toasted, about 8 minutes. Cool slightly. Finely grind toasted spices in blender, spice grinder, or with a mortar and pestle. Transfer to a small bowl. Mix in sugar and salt. Prep the pan and the pork: Heat a large cast iron frying pan to medium high or high heat (hot enough to sear the meat). If using bone-in chops, score the fat that surrounds the chops with a couple vertical cuts to help prevent the chops from buckling as they cook. Sprinkle a pinch of dry rub spices (about 1/8 teaspoon or a little more) on each of the pork chops. Using your fingers, rub the spices into the meat. Turn the pork chops over and repeat on the other side. Add the chops to the pan: Once the pan is hot, add a teaspoon of oil or fat to the pan and coat the bottom of the pan. Right before you put the pork chops into the pan sprinkle each side with a little salt, or you can salt the chops in the pan. Place the pork chops with the thickest, boniest parts toward the center of the pan where they get the most heat. Make sure the chops are not crowding each other too much. You may need to cook them in batches. There should be space between the chops in the pan or the meat will steam and not sear properly. Sear the chops on both sides: Sear the pork chops, about 2 minutes on each side. Watch carefully, as soon as the chops are browned, flip them. As soon as you flip the pork chops, if you are using a cast iron pan, you can turn off the heat. Cast iron holds heat very well and there will be enough heat in the pan to finish cooking the meat. Cover pan if working with thick chops to finish cooking: If you have chops that are a lot thicker than 3/4-inch (many are sold that are 1 1/2-inches thick), you can put a cover on the pan and let the pork chops finish cooking for 5 minutes or so. If you are using a cast iron pan and have turned off the heat, there should be enough heat if you cover the pan to finish the cooking of a thicker chop. If not, turn the heat to low and cover. The easiest way to tell when the pork chops are done is to press on them with your fingertip. If they are firm to the touch, they are done. (See the touch test.) If you wait until you see juice oozing out of the top of a chop, it is definitely done. You can also check the internal temperature of the pork with a digital thermometer; when the pork registers 145°F in the middle, it’s done.",
        "servings": 4,
        "prep_time": "10 Minutes",
        "cook_time": "15 Minutes",
        "total_time": 25
},
{
        "name": "Braised Short Ribs with Root Beer BBQ Sauce",
        "description": "Braise short ribs in the oven for melt-in-your-mouth tender beef. This recipe features a unique sticky-sweet and savory homemade root beer BBQ sauce for a memorable main dish.",
        "image": "https://www.simplyrecipes.com/thmb/78eTGJ0sXZpT-JvT6Dy4EMiRcCs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Brasied-BBQ-Ribs-LEAD-01-42d6f98c87314830bc11d7ef6d7e720f.jpg",
        "main_protein": "Beef",
        "ingredients": "For the short ribs 6 pounds beef short ribs, bone-in (about 8 large pieces), 1 1/2 tablespoons kosher salt, 1 teaspoon freshly ground black pepper, 2 teaspoons canola or vegetable oil, 4 cups low sodium beef brothfd, 1/2 cup red wine (optional), 3 ribs celery, cut ihirds, 1/2 large onion, cut into 1-inch pieces, 3 medium carrots, cut into thirds, 4 cloves garlic, peeled but left whole, 2 sprigs fresh thyme For the BBQ sauce 1 (20-ounce) bottle root beer, 1/2 cup ketchup, 2 tablespoons soy sauce, 2 tablespoons cold brew concentrate or espresso, 1 tablespoon apple cider vinegar, 1 tablespoon Worcestershire sauce, 1 tablespoon yellow mustard, 1 teaspoon brown sugar, 1/2 teaspoon garlic powder, 1/2 teaspoon kosher salt, 1/4 teaspoon black pepper, 1/4 teaspoon cinnamon, 1 whole star anise",
        "instructions": "Brown the short ribs: Preheat the oven to 350ºF. Season the short ribs all over with the salt and pepper. Heat the oil in a large dutch oven over medium-high heat. Add half the short ribs and brown deeply on each side, about 15 minutes total. Set aside and repeat with the remaining short ribs. Braise the short ribs: Place the short ribs in a deep 9x13-inch baking dish so that the meatier side is facing down and the bone is facing up. You’ll have to snuggle them in for a tight fit. Cover with the beef broth and red wine (if using). Add the celery, onion, carrots, garlic, and thyme, pushing the vegetables in between the short ribs to ensure they’re mostly submerged in the broth. Cover tightly with at least 2 layers of foil and place on a baking sheet. Braise until tender but not completely falling apart, 2 1/2 to 3 hours. The bones should separate from the meat and appear loose when wiggled. Make the BBQ sauce: Meanwhile, in a medium saucepan, bring the root beer to a boil over high heat. Continue to boil, stirring occasionally, until root beer is reduced by 2/3, about 15 minutes. With the heat still on high, add the ketchup, soy sauce, cold crew or espresso, apple cider vinegar, Worcestershire sauce, yellow mustard, brown sugar, garlic powder, salt, pepper, cinnamon, and star anise. Bring to a boil, then reduce the heat to medium. Continue to cook, stirring frequently, until the sauce has thickened to the consistency of bottled BBQ sauce, 10 to 15 minutes. Remove and discard the star anise. Set the sauce aside. Glaze the short ribs: Preheat oven to 500ºF or a low broil setting. Remove the short ribs from the baking dish and transfer to a small foil-lined sheet pan in a single layer. Pull out the bones (they should slip out easily if your short ribs are tender enough!) and discard. Brush the short ribs with half the BBQ sauce, flip, and brush the other side with the remaining sauce. Bake: Bake or broil the short ribs until the sauce has thickened and is slightly sticky, 5 to 10 minutes. Broilers vary widely, so keep a close eye to ensure the sugars don’t burn. Leftover braised short ribs can be refrigerated in an airtight container for up to 4 days. To reheat, cover with a damp paper towel and microwave on 70% power for 2 to 4 minutes, heat in a skillet with a splash of water over medium heat for 7 to 10 minutes, or bake in a 325ºF oven, uncovered, for 15 to 20 minutes.",
        "servings": 6,
        "prep_time": "10 Minutes",
        "cook_time": "3 Hours 30 Minutes",
        "total_time": 220
},
{
        "name": "Spinach Tofu Scramble",
        "description": "This quick and nourishing Spinach Tofu Scramble suits any meal, not just breakfast. It calls for spinach, but add any veggies and power up with plant-based protein!",
        "image": "https://www.simplyrecipes.com/thmb/0nGbbUuuYOq949KYAj-h5D-HXIU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Spinach-Tofu-Scramble-LEAD-4-932c70c44636451da8505f48f34dd1e7.jpg",
        "main_protein": "Vegetarian",
        "ingredients": "1 tablespoon extra virgin olive oil, 1/2 (about 1/2 cup) yellow onion, diced, 1 pound firm or extra firm tofu packed in water, drained well, 1 teaspoon nutritional yeast, 1/2 teaspoon kosher salt, plus more to taste, 1/4 teaspoon freshly ground black pepper, plus more to taste, 1/4 teaspoon ground turmeric, 4 cups loosely packed fresh spinach leaves, 1/4 teaspoon lemon juice",
        "instructions": "Cook the onion: Heat a medium skillet over medium-high heat. Add oil; when it ripples, add the onion. Cook, stirring occasionally, until the onion is soft, 3 to 5 minutes. Add the tofu and seasonings: Use your fingers to crumble the drained tofu into bite-sized pieces. You can do this directly over the skillet. Add the nutritional yeast, salt, pepper, and turmeric, and stir to combine. Cook, stirring occasionally, until the tofu is hot, about 3 minutes. You’re not aiming to brown the tofu here, but if that happens a little, it’s not an issue. Add the spinach, wilt, and finish with lemon juice: Add the spinach and cook until wilted, 1 minute. Sprinkle the lemon juice over the scramble. Taste and adjust the seasoning with salt and pepper, if needed. Leftover tofu scramble will keep in a tightly covered container up to four days. I don’t recommend freezing it.",
        "servings": 3,
        "prep_time": "7 Minutes",
        "cook_time": "8 Minutes",
        "total_time": 15
},
{
        "name": "Salmon with Lemon Cream Sauce",
        "description": "This salmon with cream sauce recipe has a simple, quick lemon cream sauce that comes together as the fish is frying. Dinner is on the table in 20 minutes!",
        "image": "https://www.simplyrecipes.com/thmb/mSin-XWC3NnkMjZOUaqaNS7C7QY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2012__03__salmon-lemon-cream-sauce-vertical-a-1600-c8f85de340804b528c5166a2d376d639.jpg",
        "main_protein": "Fish",
        "ingredients": "3 tablespoons lemon juice, 1/4 cup chicken broth, fish stock, clam juice, white wine, or water, 2/3 cup heavy cream, 1 tablespoon extra virgin olive oil or rice bran oil, Kosher salt, Freshly ground black pepper, 1 1/2 pounds salmon fillets, Parsley, for garnish, Thinly sliced lemon, for garnish",
        "instructions": "Cook the sauce: Pour the lemon juice, broth, and cream into a small pot and bring to a simmer. Immediately lower the heat to low, cover the pot, and simmer gently for 10 minutes. Add salt and pepper to taste. The last minute or two, uncover the pot and increase the heat to high to reduce the sauce a bit. Prep the salmon: While the sauce is cooking, check the salmon for any stray scales (if skin-on). Use needle nose pliers to remove any pin bones. Cook the salmon fillets: Add the oil to a sauté pan large enough to fit the fillets in one layer. Heat the pan on high and let the pan heat up for 90 seconds. Lay the fillets in the hot pan and lower the heat to medium. Let the fillets sizzle steadily for 3 to 5 minutes, depending on how thick the fish is. A 1-inch-thick fillet will take about 5 minutes. With a metal spatula, gently turn the fillets over. Cook for another 1 to 5 minutes, depending on how well-done you like your fish. We like our salmon a little rare in the center, so we cook the second side of a 1-inch fillet about 3 minutes. Pour lemon cream sauce over the salmon: Place the salmon fillets on plates and pour lemon cream sauce over them and sprinkle with chopped parsley to serve. If you've crisped up the skin, serve the fillets skin-side up so they stay crispy. Otherwise, serve the fillets skin-side down.",
        "servings": 4,
        "prep_time": "5 Minutes",
        "cook_time": "15 Minutes",
        "total_time": 20
},      
{
        "name": "Slow Cooker Pork Loin with Balsamic Honey Glaze",
        "description": "The season of the slow cooker has arrived, and this slow cooker Balsamic Honey Pork Loin is a must-make recipe! Eat it sliced with cooking liquid spooned over the top or reduce the liquid to make a scrumptious pan sauce. It’s a bit of a flavor twist, but you will love it and keep coming back for more!",
        "image": "https://www.simplyrecipes.com/thmb/PwUjg_Wb3G51JLEuyOyW4dshwh4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2020__12__Crock-Pot-Pork_Loin-LEAD-1-46c7e3271142423889560ff2b35a243c.jpg",
        "main_protein": "Pork",
        "ingredients": "1 (2-3 pound) pork loin, 1 1/4 teaspoons kosher salt, 1 1/4 teaspoons coarse black pepper, 1 1/4 teaspoons dried thyme, 2 tablespoons olive oil, 1/4 cup chicken stock or water, 1/4 cup balsamic vinegar, 1/4 cup honey, 4 cloves garlic, peeled and smashed, 1 tablespoon cornstarch, 1 1/2 tablespoons cold water",
        "instructions": "Prep the pork loin: Season pork loin all over with salt, pepper, and thyme. Sear the pork loin: Set a large skillet (cast iron works best) over medium-high heat. Add olive oil to the skillet. Once the oil begins to shimmer, add the pork loin fattiest side down, and sear pork loin for 5-6 minutes, then flip and sear on the other side for an additional 5-6 minutes. Transfer the meat and deglaze the pan: Transfer the seared pork loin to a large slow cooker along with any juices in the skillet. If there are any stuck bits in the pan, deglaze the pan with a splash of stock and add to the slow cooker.Slow cook the pork: Add stock, vinegar, honey, and smashed garlic to the slow cooker. Cook pork loin on high heat until the pork loin reaches 140 ̊F-145 ̊F in the thickest part of the loin. Start checking the temperature after 1-1/2 hours, but it may take up to 3 hours. Make the honey balsamic glaze: Into a small saucepan set over medium-low heat, add 1 1/2 cups of the cooking liquid from the slow cooker and bring to a simmer. (If you don't have enough liquid from the slow cooker to reach 1 1/2 cups, just top it off with more stock.)In a separate small bowl, whisk together cornstarch with water and whisk into the simmering glaze. Once the sauce glaze has thickened, this should only take a couple of minutes, remove it from the heat. Serve: When you’re ready to serve the pork loin, slice into 1/4- to 1/2-inch slices. Pour the glaze over the slices.",
        "servings": 6,
        "prep_time": "20 Minutes",
        "cook_time": "2 Hours 30 Minutes",
        "total_time": 170
},
{
        "name": "Beef Noodle Casserole",
        "description": "This is the best beef noodle casserole ever! My favorite recipe from my grandmother is this casserole with plenty of vegetables, ground beef, and egg noodles. Top with grated cheddar cheese.",
        "image": "https://www.simplyrecipes.com/thmb/sNn5p7WNlGz56UlGdYE2tPiiiYs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2008__10__beef-noodle-casserole-talerine-horiz-a-1600-ba1cbe27a8724750abffaaba69a27554.jpg",
        "main_protein": "Beef",
        "ingredients": "1 tablespoon plus 1/2 teaspoon kosher salt, divided, plus more to taste, 2 tablespoons extra virgin olive oil, 1 medium white onion, chopped (1 1/2 cups), 1 bell pepper, seeded, ribs removed, finely chopped, about 1 cup, 3 cloves garlic, minced, about 1 tablespoon, 1 (28-ounce) can whole peeled or crushed tomatoes, 1 1/2 pounds ground beef, 4 ounces mushrooms, sliced, 12 ounces egg noodles, 1 1/2 cups frozen corn, defrosted, 1 (15-ounce) can black olives, strained and chopped, 8 ounces cheddar cheese, grated",
        "instructions": "Preheat the oven, start heating the water: Preheat the oven to 350°F. Add 1 tablespoon of the salt to 2 quarts water in a large pot, and start to bring to a boil for cooking the egg noodles. Make the tomato sauce: Heat 1 tablespoon of oil on medium high heat in a large, heavy bottomed pot or skillet. Add the onions and bell pepper and sauté until softened, about 4 minutes. Add the garlic and cook for a minute more. Add the tomatoes, breaking them up with your fingers or a knife if you are using whole canned tomatoes. Bring to a simmer and let cook for 10 minutes. Lower the heat to warm. Brown the ground beef, then season: In a separate skillet, add 1 tablespoon of oil and heat to medium-high. Working in batches, so you do not crowd the pan, add the ground beef, breaking it up with your fingers as you add it to the pan. Do not stir the ground beef, but let it sit and cook for a minute or two until it browns on one side. Sprinkle 1/2 teaspoon of the salt over the meat while cooking. Once browned on one side, turn the pieces over to get the other side browned. Once the meat is mostly browned (can still be rare in the center), remove the beef from the pan and add to the tomato onion mixture. Sauté the mushrooms: Add the mushrooms to the same pan that you had used for browning the beef and sauté the mushrooms in the remaining oil and beef drippings. Once browned, add the mushrooms to the beef and tomato mixture Cook the egg noodles: While the mushrooms are cooking, add the egg noodle pasta to the boiling water. Cook as directed, about 4-5 minutes. Strain when cooked, but still a little firm (al dente). Add everything to the casserole: Add the cooked egg noodles to a large (3 quart) casserole dish. (If your casserole dish isn't big enough, you may need to use 2 casserole dishes.) Stir in the tomato beef mixture. Stir in the corn, chopped olives, and about two thirds of the cheese. Bake: Sprinkle remaining cheese on top of casserole. Place in the oven. Bake uncovered at 350°F for 30 minutes.",
        "servings": 8,
        "prep_time": "20 Minutes",
        "cook_time": "60 Minutes",
        "total_time": 80
},
{
        "name": "Chinese Orange Chicken",
        "description": "Get the best of Chinese orange chicken takeout at home! This recipe is loaded with sweet citrus flavors, sesame seeds, and scallions. It’s surprisingly easy to make. All you need is a large skillet. And don’t skip the orange zest in the sauce—it’s the most important piece!",
        "image": "https://www.simplyrecipes.com/thmb/LciL4vqF3XwzJWVImCi596ynKw0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2020__01__Chinese-Orange-Chicken-Lead-3-ebc5797467a940198207688838959780.jpg",
        "main_protein": "Chicken",
        "ingredients": "For the orange sauce: Zest from 1 orange, 1/4 cup orange juice, 1/4 cup soy sauce, 1/4 cup water, 1/3 cup rice vinegar, 1 tablespoon cornstarch, 1 tablespoon sesame oil, 1/2 cup sugar For the chicken: 1 1/2 pounds boneless, skinless chicken thighs, 2 large eggs, 1 teaspoon salt, 1/4 teaspoon black pepper, 1/2 cup cornstarch, 1/2 cup all-purpose flour, 2 cups vegetable oil, for frying, 2 cloves garlic, chopped, 1 large shallot, chopped, To garnish and serve: Sliced scallions, garnish, Sesame seeds, garnish, Cooked white rice, to serve",
        "instructions": "Make the orange sauce: Whisk together sauce ingredients in a medium bowl. Set aside. Prep the chicken: Cut chicken into about 1-inch cubes. Whisk eggs with salt and black pepper in a bowl and add chicken. Stir together. In a separate bowl, whisk together flour and cornstarch. Remove chicken from eggs with a slotted spoon or tongs, letting excess egg drain off, then transfer to cornstarch mixture and coat well. Fry the chicken: Add oil to a large 10- to 12-inch skillet. Heat over medium-high heat until it reaches 350 ̊F. If you don’t have a thermometer, you can also test the temperature by sprinkling in some flour and it should fizzle immediately. Once oil is hot, fry the chicken in two batches. The oil might not completely cover the chicken—that’s okay. Cook for 3-4 minutes. Flip the chicken pieces and cook until the chicken is cooked through, about 3 to 4 more minutes. Total cook time is about 6-8 minutes. Remove fried chicken cubes and transfer to a plate lined with paper towels, so the chicken can drain. Repeat until all the chicken is cooked. Simmer the chicken in the sauce: Once chicken is done, pour out hot oil and wipe pan clean. Add a fresh tablespoon of oil along with chopped garlic and shallot. Cook for a minute and then add the sauce. Simmer the sauce until it starts to thicken. Once the sauce is lightly bubbling, add fried chicken and toss together to coat. The sauce should continue to thicken and stick to the chicken. Let simmer for a minute or two more. Serve orange chicken over cooked white rice, garnished with sesame seeds and fresh scallions.",
        "servings": 4,
        "prep_time": "20 Minutes",
        "cook_time": "15 Minutes",
        "total_time": 35
},
{
        "name": "Mediterranean Chickpea Salad",
        "description": "This healthy summer salad is easy to make and celebrates all the fresh vegetable and herbs of summer. Chickpeas add protein and a tangy vinaigrette brings it all together.",
        "image": "https://www.simplyrecipes.com/thmb/630qn4om590CyPU9oJPCIc0UDDw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Mediterranean-Chickpea-Salad-LEAD-1-513acdc46f50442ca25d30e9d931b650.jpg",
        "main_protein": "Vegeterian/*",
        "ingredients": "For the vinaigrette 2 tablespoons olive oil, 2 tablespoons red wine vinegar, 1 teaspoon dried oregano, 1/2 teaspoon kosher salt, plus more as needed, 1/4 teaspoon freshly ground black pepper, plus more as needed For the salad, 2 (15-ounce) cans chickpeas, drained and rinsed, 1 (12 ounce) jar quartered and marinated artichoke hearts, drained, 1 pint cherry tomato or grape tomatoes, halved, 2 Persian cucumbers, halved lengthwise and thinly sliced, 2/3 cup pitted Kalamata olives, halved, 4 scallions (about 1/2 cup), white and green parts, thinly sliced, 2 tablespoons fresh mint leaves, chopped, 6 ounces (about 1 1/2 cups), feta cheese, crumbled",
        "instructions": "Make the oregano vinaigrette: In a large bowl, whisk together the olive oil, red wine vinegar, dried oregano, kosher salt, and freshly ground black pepper. Add salad ingredients to vinaigrette: Add the chickpeas, artichoke hearts, tomatoes, cucumbers, olives, scallions, and mint to the bowl. Toss well to combine and coat in the vinaigrette. Add the feta cheese and toss gently to combine. Taste and season with additional salt and pepper as needed. Serve: Serve immediately or cover and refrigerate. You can keep this salad in the fridge covered, for 5 days. Enjoy cold or at room temperature.",
        "servings": 6,
        "prep_time": "15 Minutes",
        "cook_time": "N/A",
        "total_time": 15
},
{
        "name": "Smoked Salmon Pasta",
        "description": "Smoked salmon with pasta in a sauce of shallots, garlic, white wine, lemon, and cream, with toasted pine nuts and parsley.",
        "image": "https://www.simplyrecipes.com/thmb/FO10iCGpSSnJ7rskTsOpiY2kBgQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2008__03__smoked-salmon-pasta-horiz-a-1200-51df218ff58442ccace3a1a33d233b10.jpg",
        "main_protein": "Fish",
        "ingredients": "8 ounces spaghetti, or other pasta, Salt, 1/4 cup pine nuts, 2 tablespoons extra virgin olive oil, 1/3 cup chopped shallots or onions, 2 cloves garlic, minced, 1/3 cup dry white wine (can substitute pasta cooking water with 1 tablespoon lemon juice), 1/4 cup cream, 1 tablespoon lemon juice, 2 tablespoons lemon zest, divided, 2 tablespoons chopped fresh parsley or dill, 4 ounces smoked salmon, cut into bite-sized pieces, Freshly ground black pepper", 
        "instructions": "Put pasta water on to boil: Heat to boiling a large pot with at least 4 quarts of salted water in it. (2 tablespoons of salt for 4 quarts of water.) Toast the pine nuts: While the water is heating, brown the pine nuts. Put the pine nuts in a single layer in a large skillet. Heat on medium heat, stirring occasionally, until fragrant and lightly browned. Remove pine nuts from pan and set aside. Start cooking the pasta: Once the water is boiling, add the pasta to the pot. Cook uncovered on high heat at a rolling boil. Put the timer on for 8-10 minutes, or whatever your pasta package says is appropriate for al dente (cooked but still a little firm). Once the pasta is done, and before draining the pasta, scoop out one cup of the pasta cooking liquid and reserve. Prepare the sauce: While the pasta is cooking, prepare the sauce. In a large skillet heat olive oil on medium heat. Add the shallots and garlic, cook for 2 minutes, then add white wine, lemon juice, and 1 Tbsp of lemon zest. Increase the heat and let boil down by half. If you want a slightly creamy sauce, add the cream and let boil a minute more. The sauce should be done about the same time the pasta is done. If you get done earlier with it than the pasta, take it off the heat. Add pasta, some pasta cooking liquid, smoked salmon, toasted pine nuts, parsley, zest to sauce: Drain the pasta and add it to the skillet with the sauce. Add back some of the pasta cooking liquid to the pasta if it is a little dry. Add the smoked salmon, toasted pine nuts, parsley, and the remaining lemon zest. Season with freshly ground black pepper.",
        "servings": 2,
        "prep_time": "10 Minutes",
        "cook_time": "30 Minutes",
        "total_time": 40
},
{
    "name": "Lentil Soup",
    "description": "Three things make this vegetarian lentil soup so good: caramelized onions, toasted tomato paste (it's easy!), and lots of carrots and celery. Make a big pot to have some now and save some for later—this soup is freezer friendly!",
    "image": "https://www.simplyrecipes.com/thmb/5IX1ej1K6qOffZHZ8yNjmDe4sog=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__10__Vegetarian-Lentil-Soup-LEAD-1-97bd8e2d04954bbc861ee3241fddbe17.jpg",
    "main_protein": "Vegeterian",
    "ingredients": "2 tablespoons olive oil, 1 large yellow onion, finely diced, 2 tablespoons tomato paste, 1 teaspoon dried thyme, 1 clove garlic, finely diced, 3 stalks celery, finely diced, 3 carrots, peeled and finely diced, 2 cups (12 ounces) small green French lentils, 8 cups water or vegetable stock, 1 tablespoon low-sodium soy sauce, 1 1/2 teaspoons kosher salt, plus more to taste, 1/8 teaspoon freshly ground black pepper, plus more to taste, 3 tablespoons lemon juice, plus more to taste, 1/2 bunch kale, stemmed and thinly sliced crosswise",
    "instructions": "Caramelize the onions: In a soup pot over medium heat, heat the olive oil. Once the oil shimmers, add the onions and cook, stirring occasionally for 10 minutes, or until deep, golden brown. Cook the tomato paste and vegetables: Push the onions to the side of the pot. And in the space you made, add the tomato paste. Stir for 2 to 3 minutes, or until the tomato paste darkens to a ruddy brown. Add the thyme, garlic, celery, and carrots. Cook and stir for 2 minutes. Add the lentils and liquid, then simmer: Add the lentils, 8 cups water, soy sauce, salt and pepper to the pot. Adjust the heat to medium, so the soup is just at a gentle simmer. Simmer for 55 to 60 minutes, or until the lentils are soft. Finish the soup and serve: Scoop out 2 cups of the soup and purée it in a blender until smooth, or use an immersion blender and purée just until the soup takes on a little body and thickens, but you still have texture. Return the blended soup to the pot and stir in the lemon juice. Add the sliced kale and simmer until the kale softens, about 1 to 2 minutes.",
    "servings": 6,
    "prep_time": "15 Minutes",
    "cook_time": "60 Minutes",
    "total_time": 75
},
{
    "name": "Blackened Shrimp Tacos",
    "description": "These blackened shrimp tacos make a great light lunch or dinner during spring and summer! With juicy blackened shrimp and tangy red cabbage slaw, they get to the table in no time.",
    "image": "https://www.simplyrecipes.com/thmb/M3egAEdx1CsGEQLuCwhg5IZf3aE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Blackened-Shrimp-Tacos-LEAD-05b-b4b8e0d1ef90483c9380357209fbeea2.jpg",
    "main_protein": "Fish",
    "ingredients": "For the shrimp tacos 2 pounds extra-large shrimp (26-30 count), peeled, cleaned, and deveined, 2 teaspoons blackened seasoning, 1/2 teaspoon salt, if needed,8 corn or flour tortillas, For the cabbage slaw, 2 cups thinly sliced red cabbage, 1/4 cup mayonnaise, 1/2 tablespoon granulated sugar, 1/4 teaspoon black pepper, 1/2 tablespoon white vinegar, 1 tablespoon vegetable oil, avocado oil, or grapeseed oil, For serving, 1/2 cup crumbled Mexican queso fresco, 1/2 cup chopped cilantro, Lime wedges",
    "instructions": "Preheat the oven to 300°F. Wrap the tortillas in foil and place them on a baking sheet or pan. Season the shrimp: In a large bowl combine the shrimp, blackening seasoning, and salt. Warm the tortillas: Bake the foil-wrapped tortillas until the they are warmed through, about 10 minutes. (If your tortillas are done before you finish the slaw and shrimp, turn off the oven, and leave the tortillas inside to stay warm until you are ready to assemble.) Make the cabbage slaw: In a large bowl, combine the cabbage, mayo, sugar, black pepper, and white vinegar. Cook the shrimp: In a large nonstick skillet over medium-high heat, add in the oil. Once it’s hot, add the shrimp. Cook, until the shrimp have slightly browned on the outside and they have cooked through turning pink throughout, flipping halfway through, 2 to 3 minutes per side. Assemble the tortillas: Place the tortillas in a serving platter or plates. Divide the shrimp and slaw equally between the tortillas. Garnish and serve: Garnish with cheese and cilantro. Serve with lime wedges. Serve.",
    "servings": 4,
    "prep_time": "15 Minutes",
    "cook_time": "16 Minutes",
    "total_time": 31
},
{
    "name": "Beer Brats",
    "description": "Beer brats are guaranteed charred, juicy, and never dry. Make them all summer long.",
    "image": "https://www.simplyrecipes.com/thmb/4-g9o9wQ2aJva8ZVAf56l0I-DcA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-BeerBrats-LEAD-08-76f76ce275c342219baf3f485b650ce5.jpg",
    "main_protein": "Pork",
    "ingredients": "5 fresh bratwursts, 2 (12-ounce) lager beers, like a pilsner, 5 sausage buns",
    "instructions": "Prepare the grill: Prepare a grill for two-zone medium heat, 350º to 450º F. On a gas grill, this means one side with burners on high and the other side off. On a charcoal grill, place the lit charcoals on one side and keep the other side without any. Preheat the grill for at least 15 minutes with the lid on. Sear the brats: Grill the brats over direct heat—right over the lit coals and burners—for 2 minutes total, flipping once. Keep the grill lid on. Cook the brats in beer: Place the aluminum foil pan on the grill over indirect heat—away from the lit coals and burners. Place the brats in the pan and fill the pan with the beer. Lower the lid and cook until the internal temperature of the brats reads 145º F with an instant-read thermometer, 20 to 25 minutes, flipping once halfway through. Grill the buns: Grill the buns, cut side down over direct heat until marked, about 1 minute. Serve: Load the buns with the brats and your favorite toppings.",
    "servings": 2,
    "prep_time": "15 Minutes",
    "cook_time": "25 Minutes",
    "total_time": 40
},
{
    "name": "Roast Beef Tenderloin with Sautéed Mushrooms",
    "description": "Roast beef tenderloin is seared, then oven-roasted and served with mushrooms sautéed in the pan drippings with butter and herbs. Try it for your next holiday dinner or any special occasion!",
    "image": "https://www.simplyrecipes.com/thmb/2f-NMlw0Le1uCrkcR1ndQQHSYoI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2015__02__roast-beef-tenderloin-vertical-a-1200-0827855165934a41a72eb4ba89f93ae7.jpg",
    "main_protein": "Beef",
    "ingredients": "1 3/4 to 2 pound section beef tenderloin (preferably a piece cut from the center), trimmed of excess fat and silverskin, 1 teaspoon kosher salt, 1/2 teaspoon coarsely ground black pepper, 1 1/2 tablespoons extra virgin olive oil, 1 pound cremini mushrooms, sliced 1/8 to 1/4 inch thick, 3 tablespoons butter, 1 teaspoon salt (use 1/2 teaspoon if using salted butter), 2 tablespoons minced shallots, 2 tablespoons minced garlic, 1 1/2 teaspoons Herbs de Provence or 1 teaspoon of dried tarragon",
    "instructions": "Season the roast, let sit at room temp: Remove roast from refrigerator 1 to 2 hours before cooking so that it has time to come close to room temperature. Sprinkle all sides with salt and pepper and set aside. Preheat the oven: Preheat oven to 425°F after the roast has come to room temperature. Sear the roast on the stovetop: When ready to cook the tenderloin roast, preheat oven to 425°F. Heat olive oil in a cast iron or thick-bottomed sauté pan that can take the heat, on high heat. When the oil is hot, place the roast in the pan and brown it on all sides, including the ends, about 10 minutes. Place the roast in the oven: When sufficiently browned, remove the roast from the pan (do not clean out the pan) and place in a roasting pan. Place in the oven and roast at 425°F until the internal temperature is 130°F for rare (140°F for medium), about 20 minutes (or longer if your roast wasn't at room temp to begin with. Use a meat thermometer! Let the roast rest before slicing: Remove from oven and loosely tent with foil to rest for 15 to 20 minutes before slicing. Sauté the shallots, garlic, and mushrooms: While the roast is resting, prepare the mushrooms. Add 3 tablespoons of butter to the same pan you used to sear the beef roast. Heat on medium heat to melt the butter. Add the minced shallots and garlic, and cook for half a minute. Stir the mushrooms into the pan and cook until they start to give off steam. Then add salt, pepper, and herbs de provence. Continue to cook until just cooked through. Add a few tablespoons of warm water to the pan to scrape up any remnants from the bottom of the pan (can also use white wine or marsala). Remove from heat. Slice the roast: Use a sharp knife to slice the roast across the grain into 1/4 to 1/2-inch thick slices. Serve with the sautéed mushrooms.",
    "servings": 4,
    "prep_time": "15 Minutes",
    "cook_time": "45 Minutes",
    "total_time": 60
},
{
    "name": "Lemon Pepper Chicken Breasts",
    "description": "Weeknight dinner is solved with these easy-to-make pan-fried chicken breasts smothered in a lemon pepper sauce. Serve this lemon pepper chicken breast recipe with rice or mashed potatoes.erloin is seared, then oven-roasted and served with mushrooms sautéed in the pan drippings with butter and herbs. Try it for your next holiday dinner or any special occasion!",
    "image": "https://www.simplyrecipes.com/thmb/Yd0RcUwJJEB0tU75rBw3GsOTMQk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Lemon-Pepper-Chicken-LEAD-2-6b2babc56fc54fff9c5c332622efdef1.jpg",
    "main_protein": "Chicken",
    "ingredients":"1 1/2 to 1 3/4 pounds boneless, skinless chicken breasts (about 2 large chicken breasts), 1 1/2 tablespoons lemon pepper seasoning, divided, 1/2 teaspoon kosher salt, plus more to taste, 3/4 cup all-purpose flour, 1 1/2 tablespoons vegetable oil, 4 tablespoons unsalted butter, divided, 2 cloves garlic, minced or grated, 1/2 cup chicken stock, 1/3 cup freshly squeezed lemon juice (from 2 lemons), 1/4 cup Italian parsley, chopped, Lemon slices, for garnish (optional)",
    "instructions": "Cut the chicken breast into cutlets: Place the palm of your hand flat against the top of a whole chicken breast to keep it from sliding around. With the broad side of your knife horizontal to the cutting board, cut through the chicken breast to create 2 thinner halves (cutlets). Season, then dredge the chicken breasts: In a small bowl, combine 4 teaspoons of the lemon pepper seasoning and the salt. Add the flour to a separate shallow dish. Season both sides of each of the chicken breasts with the spice mixture. Dredge both sides of the seasoned chicken in the flour, shaking off any excess flour, then lay the dredged chicken on a wire rack or platter while you heat the pan. Pan-fry the chicken: In a large skillet, heat the oil and 2 tablespoons of the butter over medium heat. Once the butter is melted, swirl the pan a little to combine the two fats. Once the oil in the skillet begins to shimmer, lay your chicken cutlets in a single layer in the pan. You may need to fry in batches. Fry the chicken for 3 minutes without moving. Use a pair of tongs to flip the chicken and fry until they’re cooked through, an additional 2 1/2 to 3 minutes. Use your tongs to remove the chicken from the skillet to a platter. Make the lemon pepper sauce: Discard the darkened fat from the skillet. Return the skillet to the stove and add the remaining butter. Melt the butter in the pan over medium heat. Once the butter has melted, add the garlic. Sauté the garlic in the butter until fragrant, 30 to 45 seconds. Add the chicken stock and lemon juice and deglaze the pan, scraping up any browned bits from the bottom of the pan. Allow the liquid in the skillet to come to a boil and continue to boil until very slightly thickened, about 1 minute. Season the sauce with the remaining 1/2 teaspoon of lemon pepper seasoning and salt to taste. Coat the chicken: Once the sauce has reduced slightly, return the chicken breasts to the pan. Turn them over to coat both sides in the sauce and turn the stove off. Allow the residual heat from the pan to warm the chicken up before sprinkling the chopped parsley over top. Garnish with lemon slices and serve.", 
    "servings": 4,
    "prep_time": "12 Minutes",
    "cook_time": "15 Minutes",
    "total_time": 27
  },
  {
    "name": "Salmon Avocado Poke Bowl",
    "description": "Hawaiian poke is a rice bowl topped with fresh, sushi-grade fish and lots of fun toppings. This salmon avocado poke bowl recipe is a super simple, light meal.",
    "image": "https://www.simplyrecipes.com/thmb/j7MGsOIQsHL-5pj9utOldYnxqig=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2017__03__2017-04-26-PokeBowls-2-d525b811079745b89f1aa215548e3284.jpg",
    "main_protein": "Fish",
    "ingredients": "For the poke bowl 1 cup short-grain white rice, 1 pound sashimi-grade salmon, 1/4 cup soy sauce, 1 1/2 tablespoons rice vinegar, 1/2 tablespoon sugar, 1 teaspoon toasted sesame oil, 1/4 teaspoon garlic powder, 2 scallions, thinly sliced. Other toppings Sliced cucumber, Sliced radish, 1 large avocado, cubed, Furikake, Red pepper flakes.",
    "instructions": "Cook the rice: Start the rice first and prep the rest of the ingredients while it cooks. Rinse the rice a few times under cool water, rubbing it gently with your hands, until the water isn't quite so cloudy. Then cook the rice according to package instructions or in a rice cooker. Fluff and keep covered until ready to eat. Prepare the salmon: Gently pat the salmon all over to make sure that there are no pin bones still lodged in the fillet; if there are, use needle-nosed pliers to remove them. Cut the salmon into 1/2-inch cubes. Add the salmon into a medium bowl and set aside. Make the dressing: In a small bowl, stir together the soy sauce, rice vinegar, sesame oil, sugar and garlic powder. The garlic powder and sugar will not dissolve completely, but that's fine. Combine the salmon and the dressing: Add the sliced scallions to the bowl with the salmon, saving 1 to 2 tablespoons for garnish. Add the soy sauce mixture to the salmon and scallions. Using a large spoon or a rubber spatula, gently mix the salmon with the soy sauce mixture. Serve: Divide the rice between each bowl and then the salmon. Top with the rest of the sliced scallions, sliced cucumber, sliced radishes, diced avocado, furikake and red pepper flakes, if you like. The poke bowl is best enjoyed immediately.",
    "servings": 2,
    "prep_time": "20 Minutes",
    "cook_time": "N/A",
    "total_time": 20
  },
  {
    "name": "Easy Shepherd's Pie",
    "description": "Favorite shepherd's pie recipe, a classic casserole of Britain and Ireland done American-style. Cook ground beef and savory vegetables, top with mashed potatoes, and bake to perfection.",
    "image": "https://www.simplyrecipes.com/thmb/lE6keFCMNWOP4p4rkT4XwKikh40=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Easy-Shepherds-Pie-Lead-1-165895d900e64d9d867b4027298ad25a.jpg",
    "main_protein": "Beef",
    "ingredients": "1 teaspoon salt, plus more to taste, 3 large (1 1/2 to 2 pounds) potatoes , peeled and quartered, 8 tablespoons (1 stick) butter, divided, 1 medium onion, chopped (about 1 1/2 cups), 1 to 2 cups mixed vegetables, such as diced carrots, corn, or peas, 1 1/2 pounds ground round beef, 1/2 cup beef broth, 1 teaspoon Worcestershire sauce, Pepper and/or other seasonings of choice",
    "instructions": "Boil the potatoes: Place the peeled and quartered potatoes in medium sized pot. Cover with at least an inch of cold water. Add a teaspoon of salt. Bring to a boil, reduce to a simmer, and cook until tender (about 20 minutes). Preheat the oven to 400°F. Sauté the vegetables: While the potatoes are cooking, melt 4 tablespoons of the butter in a large sauté pan on medium heat. Add the chopped onions and cook until tender, about 6 to 10 minutes. If you are including vegetables, add them according to their cooking time. Carrots should be cooked with the onions, because they take as long to cook as the onions do. If you are including peas or corn, add them toward the end of the cooking of the onions, or after the meat starts to cook, as they take very little cooking time. Add the ground beef, then the Worcestershire sauce and broth: Add ground beef to the pan with the onions and vegetables. Cook until no longer pink. Drain the pan of excess fat, if necessary (anything more than 1 tablespoon). Season with salt and pepper. Add the Worcestershire sauce and beef broth. Bring the broth to a simmer and reduce heat to low. Cook uncovered for 10 minutes, adding more beef broth if necessary to keep the meat from drying out. Taste the cooked filling and, if needed, add more salt, pepper, Worcestershire, or other seasonings of your choice. Mash the cooked potatoes: When the potatoes are done cooking (a fork can easily pierce), remove them from the pot and place them in a bowl with the remaining 4 tablespoons of butter. Mash with a fork or potato masher, taste, and adjust seasonings with salt and pepper. Layer the meat mixture and mashed potatoes in a casserole dish: Spread the cooked filling in an even layer in a large baking dish (such as a 9 x 13-inch casserole. Spread the mashed potatoes over the top of the ground beef. Rough up the surface of the mashed potatoes with a fork so there are peaks that will get well browned. You can even use a fork to make creative designs in the mashed potatoes. Bake: Place in a 400°F oven and cook until browned and bubbling, about 30 minutes. If necessary, broil for the last few minutes to help the surface of the mashed potatoes brown. (Be careful when broiling using Pyrex or glass dishes, they have been known to shatter under the high heat of the broiler. It's not a worry if you are using a ceramic or metal casserole dish.)",
    "servings": 4,
    "prep_time": "15 Minutes",
    "cook_time": "50 Minutes",
    "total_time": 65
  }
]